rovOsc_h_T1.0/system/forces
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

forces
{
    type            forces;
    libs            ("libforces.so");

    writeControl    timeStep;
    writeInterval   1;
    log             no;

    patches         ("BROV2");

    rho             rhoInf;
    rhoInf          1000;

    CofR            (0 0 0);    // body centre = origin (vehicle frame)
}

// ************************************************************************* //
